const menuData = [
    {
        id: 'pizza', title: 'ركن البيتزا', desc: 'عجينة إيطالي بلمسة سورية، بتستوي على نار الحطب.',
        items: [
            { id: 'p1', name: 'بيتزا مارجريتا نابولي', desc: 'جبنة موتزاريلا سايحة، صوص طماطم فريش، ريحان وعجينة سميكة.', price: 75, img: 'https://images.unsplash.com/photo-1574071318508-1cdbab80d002?q=80&w=600' },
            { id: 'p2', name: 'بيتزا بيبروني بريميوم', desc: 'بيبروني بقري مدخن، موتزاريلا غرقانة، وزيتون أسود.', price: 110, img: 'https://images.unsplash.com/photo-1628840042765-356cda07504e?q=80&w=600' }
        ]
    },
    {
        id: 'shawerma', title: 'ركن السندوتشات العربية', desc: 'شاورما على السيخ بتتبيلة 14 بهار شامي أصلي.',
        items: [
            { id: 's1', name: 'شاورما دجاج سوري اكسترا', desc: 'دجاج متبل ببهارات الشام، تومية كريمي، وخيار مخلل في عيش صاج.', price: 65, img: 'https://images.unsplash.com/photo-1648902598380-007f35f793dc?q=80&w=600' },
            { id: 's2', name: 'شاورما لحم شقف', desc: 'لحم بلدي صافي، طحينة، بصل وبقدونس متحبش.', price: 85, img: 'https://images.unsplash.com/photo-1561651823-34feb02250e4?q=80&w=600' }
        ]
    },
    {
        id: 'fatayer', title: 'ركن الفطائر', desc: 'فطائر سخنة طالعة من الفرن، مقرمشة من بره وطرية من جوه.',
        items: [
            { id: 'f1', name: 'فطيرة مشكل أجبان', desc: 'ميكس شيدر، رومي، موتزاريلا مع حبة البركة.', price: 90, img: 'https://images.unsplash.com/photo-1517686469429-8bdb88b9f907?q=80&w=600' },
            { id: 'f2', name: 'فطيرة سجق بلدي', desc: 'سجق إسكندراني بخلطة الفلفل الألوان والجبنة الموتزاريلا.', price: 120, img: 'https://images.unsplash.com/photo-1565557623262-b51c2513a641?q=80&w=600' }
        ]
    },
    {
        id: 'sweet', title: 'ركن الحلويات', desc: 'الختام المسك.. حلويات بالسمن البلدي الأصلي.',
        items: [
            { id: 'w1', name: 'كنافة نابلسية بالجبنة', desc: 'كنافة بجبنة نابلسية بتمط، غرقانة شربات وفستق حلبي.', price: 60, img: 'https://images.unsplash.com/photo-1551024601-bec78aea704b?q=80&w=600' },
            { id: 'w2', name: 'بقلاوة شامي مشكلة', desc: 'تشكيلة بقلاوة مقرمشة محشية مكسرات فاخرة.', price: 70, img: 'https://images.unsplash.com/photo-1596649282570-071a17b07dbd?q=80&w=600' }
        ]
    }
];
